Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh686-v3.tmx
Source language: bo
Languages: en

source: གསེག་མ་དང་། འབབ་ཆུ་དང་། གནོད་སྦྱིན་དང་། སྲིན་པོ་དང་། ལམ་མི་བདེ་བ་ཐམས་ཅད་བསལ་བ་དང་།
en: All the locks and bolts will unlock and fall away, and all the paths under the great rivers or up the mountains that are made difficult by the yakṣas and rākṣasas will become gentle meanders.

source: བཅོམ་པ་དང་བཤིག་པར་འགྱུར་རོ། །གཏན་པ་དང་། སྒོ་གླེགས་དང་། འཁྲུལ་འཁོར་དང་། ལྕགས་སྒྲོག་རྣམས་དུམ་བུ་དུམ་བུར་བཅད་ཅིང་གྱེས་པར་འགྱུར།
en: The bolts and door locks will break into pieces, and chains will break, split, and fall off.

source: ཉམས་པར་འགྱུར། འཇིག་པར་འགྱུར་རོ།
en: They will deteriorate and disintegrate. “

source: །ཤིན་ཏུ་དག་པ་དང་ཤིན་ཏུ་དྲི་མ་མེད་པ། ཤིན་ཏུ་རྒྱ་ཆེ་བའི་གཞལ་མེད་ཁང་འབྱོར་པ་རྣམ་པར་འཕྲུལ་པ་དག་མཐོང་བར་འགྱུར་རོ།
en: Subsequently, the vidyā holder will see huge magical palaces that are immaculate and pure.

source: །རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱིས་བཀྲ་བ་རིན་པོ་ཆེ་སྣ་བདུན་གྱིས་བརྒྱན་པའི་གནས། རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱི་ལྗོན་ཤིང་གིས་བརྒྱན་པའི་གཞལ་མེད་ཁང་མཐོང་བར་འགྱུར་རོ། །མེ་ཏོག་སྣ་ཚོགས་ཀྱི་རབ་ཤིན་ཏུ་དྲི་ཞིམ་པོའི་གཞལ་མེད་ཁང་མཐོང་བར་འགྱུར་རོ། །དེ་ནས་རིག་སྔགས་འཆང་གིས་ལག་པའི་ཞགས་པ་དང་།
en: He will see palatial residences constructed from the seven types of jewels and adorned with various bright jewels and different species of jeweled trees, all enveloped in the fragrance from flower gardens with various species of flowers.

source: འཁོར་ལོའི་ཕྱག་རྒྱའི་ཚུལ་མངོན་སུམ་དུ་བགྱིས་ནས། དོན་ཡོད་པའི་ཞགས་པའི་སྙིང་པོ་བཟླས་ཏེ་འཇུག་པར་བགྱིའོ།
en: At that time, he should hold the noose with the hand that displays the mudrā, place the wheel before him, recite the heart mantra of Amoghapāśa, and enter.

source: །རིག་སྔགས་འཆང་གནས་སུ་ཞུགས་པ་ཙམ་ཁོ་ནས་གནས་མཆོག་དེ་ཡང་རྣམ་པར་དྲུག་ཏུ་འགུལ་བ་དང་།
en: As soon as he enters the palatial compound of the vidyādharas, the compound will shake in six different ways.

source: གཡོ་བ་དང་། ལྡེག་པ་དང་། འུར་འུར་ཆེམ་ཆེམ་སྟེ་ལྷའི་འོད་ཟེར་གྱི་སྣང་བ་ཆེན་པོས་སྣང་བར་འགྱུར་རོ།
en: It will move and quake, make rattling and booming sounds, and be awash in a great divine light.

source: །དེ་ནས་རིག་སྔགས་འཆང་འཇུག་པར་བགྱིའོ།
en: He should now enter. “

source: །དེ་ནས་དོན་ཡོད་པ་རྣམ་པར་དག་པ་དྲི་མ་མེད་པ་ཞེས་བགྱི་བའི་སྨན། བུད་མེད་ཀྱི་གཟུགས་ལྷའི་རྒྱན་གྱིས་བརྒྱན་པ། ལྷའི་གོས་ཀྱི་རྒྱན་གྱིས་བཀླུབས་པ་ཁ་དོག་བཟང་པོ་རྒྱས་པ། མཆོག་དང་ལྡན་པ། ལྷའི་གཟུགས་ཆེན་པོ་འཆང་བ་བཱི་ཛ་པཱུ་ར་ཐོགས་པ་མཆི་བར་འགྱུར་རོ།
en: When he enters, a medicinal goddess named Immaculate Amogha Purity will arrive in a female form adorned with celestial ornaments, clothes, and adornments, magnificent in her pure golden splendor and endowed with great divine beauty, and will hold out a citron.

source: །སྨན་བུད་མེད་ཀྱི་གཟུགས་འཆང་བ་དེ་མ་མཐོང་བ་ཙམ་ཁོ་ནས་དཔག་ཚད་གང་ཙམ་ནས། གཟི་བརྗིད་ཐམས་ཅད་དང་། སྟོབས་ཐམས་ཅད་ཉེ་བར་བསྒྲུབ་པར་བགྱིའོ།
en: Upon seeing the female form of this medicinal goddess, vitality and strength will be granted to everyone within a radius of one league.

source: །དེ་ནས་རིག་སྔགས་འཆང་གིས་དོན་ཡོད་པའི་འཁོར་ལོའི་ཞགས་པ་མདུན་དུ་བཅིང་བར་བགྱི་སྟེ།
en: The vidyā holder should, at that time, hold up the noose with the wheel of Amoghapāśa.

source: མཐོང་བཅོམ་གྱི་མོད་ལ་དེའི་སྟོབས་དང་། བརྩོན་འགྲུས་དང་། གཟི་བརྗིད་ཉམས་པར་འགྱུར་རོ། །མཐུ་ཆུང་བར་འགྱུར་རོ།
en: As soon as she sees it, all his vitality and strength will be taken away, and he will feel weak.

source: །དེ་ནས་བུད་མེད་དེ་རྒོད་པ་དང་།
en: The female being will laugh. “

source: ཨོཾ་ཞེས་བགྱི་བས་གནོན་པར་བྱའོ།
en: At that moment, the vidyā holder should suppress her with the sound of the syllable oṁ and recite the mantra of Krodharāja.

source: །ཁྲོ་བོའི་རྒྱལ་པོ་བཟླས་པར་བགྱིས་ཏེ།
en: She will fall on her face and ooze water.

source: ཁ་བུབ་ཏུ་སྒྱེལ་ནས་ཆབ་འབྱུང་བར་འགྱུར་ཏེ་ཆབ་དེ་ལ་རེག་པར་མི་བགྱིའོ། །དོན་ཡོད་རྒྱལ་པོ་བཟླས་པར་བགྱི་སྟེ།
en: He should not sprinkle himself with this water but recite the Amogharāja.

source: དེ་ནས་མིག་ཚུགས་ཀྱིས་བལྟ་བར་བགྱིད་ན།
en: She will cast amorous glances.

source: རིག་སྔགས་འཆང་གིས་ཞགས་པས་བཞུ་བར་བགྱིའོ།
en: The vidyā holder should tie her with the noose, whereupon she will ooze the water of immortality.

source: །དེའི་འོག་ཏུ་བདུད་རྩིའི་ཆབ་འབྱུང་སྟེ་བླང་བར་བགྱི་བྱུག་པར་བགྱིའོ།
en: He should collect this water and sprinkle himself.

source: །ཀུན་ཏུ་བྱུགས་པ་ཙམ་གྱིས་ནམ་མཁའ་ལ་མཆི་བར་འགྱུར་ཏེ།
en: As soon as he does this, he will rise into the air.

source: ཐོག་མར་རླུང་གི་ཕུང་པོ་ནས་འཛེགས་པར་འགྱུར་རོ།
en: At first, he will travel upon the wind.

source: །མིག་ལ་བྱུགས་ན་ཕྱོགས་བཅུ་ཐམས་ཅད་དུ་གཏོགས་པའི་དེ་བཞིན་གཤེགས་པ་བྱང་ཆུབ་སེམས་དཔའི་ཚོགས་ཀྱི་འཁོར་དང་བཅས་པ་ཐམས་ཅད་དང་། སངས་རྒྱས་ཀྱི་ཞིང་དེའི་གཞལ་མེད་ཁང་དང་། གནས་རྣམ་པར་འཕྲུལ་པ་དང་།
en: If he anoints his eyes with the water, he will be able to see everything in the ten directions, including all the tathāgatas with their retinues of bodhisattvas and all their marvelous palatial compounds in the respective buddha fields.

source: གང་དག་བཞུགས་ཤིང་གཞེས་ལ་འཚོ་བ་དག་ཅི་ལྟར་ལག་མཐིལ་ན་མཆིས་པ་དེ་བཞིན་དུ་མཐོང་བར་འགྱུར་རོ།
en: He will see them as if in the palm of his hand.

source: །གང་དག་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པ་དང་།
en: He will see the buddhas who are presently alive and those who have entered final nirvāṇa.

source: གང་དག་འདས་པ་དང་། གང་དག་མ་བྱོན་པ་དང་། གང་དག་ད་ལྟར་བྱུང་བ་དང་། སངས་རྒྱས་པ་རྣམས་དང་། གང་དག་རིང་བསྲེལ་སྙིང་པོའི་མཆོད་རྟེན་ཆེན་པོའི་སྲོག་ཤིང་གི་ཚོགས་ཅན་དག་དང་།
en: He will see all the buddhas of the past, the present, and the future, as well as the great caityas with relics in the inner sanctums and wooden posts in the pinnacles.

source: དེ་བཞིན་དུ་ཅི་ལྟར་འཁོར་གྱི་དཀྱིལ་འཁོར་གྱི་ཁང་པ་དེ་དག་ཐམས་ཅད་མཐོང་བར་འགྱུར་རོ།
en: He will see them all as houses and retinues. “

source: །བདག་ཉིད་ལ་ཀུན་ནས་བྱུགས་ཏེ།
en: He should rub his entire body with the water.

source: དེས་བྱུགས་པ་ཙམ་གྱིས་པགས་པའི་མདོག་ལྷའི་གསེར་དང་འདྲ་བར་འགྱུར་རོ།
en: As soon as he rubs himself with the water from the pot, his skin will turn a divine golden color.

source: །སྐྲ་སྔོ་ལ་ཅུང་ཟད་འཁྱིལ་བར་འགྱུར་རོ།
en: His hair will be of deep blue color with nice, wavy locks.

source: །མིག་ལྷའི་ཨུཏྤལ་སྔོན་པོ་མཆོག་འདྲ་བར་འགྱུར་རོ།
en: His eyes will turn deep blue, like exquisite celestial lotuses.

source: །ཚེ་ལྷའི་བསྐལ་པ་བརྒྱ་སྟོང་དུ་འགྱུར་རོ། །རིག་སྔགས་འཆང་གི་འཁོར་ལོས་སྒྱུར་བ་འབུམ་ཕྲག་བརྒྱ་སྟོང་ཕྲག་བཅྭ་བརྒྱད་ཀྱིས་ཡོངས་སུ་བསྐོར་བར་འགྱུར་རོ།
en: His lifespan will increase to one hundred thousand celestial eons, and he will have a retinue of eighteen million vidyādharas and hundreds of thousands of vidyādhara emperors.

source: །ལྷའི་བུ་མོ་བརྒྱ་བཞི་བཅུ་དང་། མིའམ་ཅིའི་བུ་མོ་དང་།
en: In his immediate proximity there will be seventy-two apsarases, kinnarīs, and vidyādharīs and hundreds of thousands of millions of gods.

source: རིག་སྔགས་འཆང་གི་བུ་མོ་གང་གཱའི་ཀླུང་གི་བྱེ་མ་བརྒྱ་སྟོང་ཕྲག་འབུམ་སྙེད་ཀྱིས་ཡོངས་སུ་བསྐོར་བར་འགྱུར་རོ།
en: His retinue will be as numerous as the grains of sand in the Gaṅgā river. “

source: །ཅི་ལྟར་ཡིད་ལ་བསམས་པ་དང་།
en: Whatever he wishes for will materialize as soon he thinks of it.

source: ཡིད་ལ་བརྣག་པ་ཙམ་གྱིས་ལྷའི་ཟས་ཀྱི་མཆོག་རོ་བརྒྱ་དང་ལྡན་པ་དག་མདུན་དུ་འབྱུང་བར་འགྱུར་རོ། །ལྷའི་བཏུང་བ་ཆེན་པོ་བདུད་རྩིའི་རོ་བྲོ་བདག་འབྱུང་བར་འགྱུར་རོ།
en: Divine food of one hundred exquisite tastes will appear in front of him, and the best divine beverages tasting of nectar will appear.

source: །བྱང་ཆུབ་ཀྱི་སྙིང་པོ་ལ་ཐུག་གི་བར་དུ་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོ་ཆེན་པོ་ལེགས་མཐོང་མདུན་ནས་རྒྱུག་པར་བྱེད་དོ། །དགྲ་ཐམས་ཅད་དང་། བགེགས་དང་། ལོག་འདྲེན་ཐམས་ཅད་བཅོམ་པ་དང་། ཉམས་པ་དང་། གཏུགས་པ་དང་། གཤེགས་པ་དང་། བཙལ་བ་དང་།
en: King Sudarśana with his great army will advance ahead of him, crushing all the enemies and all vighnas and vināyakas—breaking, cutting, tearing, stopping, piercing, and destroying them—right up to the moment of the vidyā holder’s ultimate realization of bodhi.

source: གྱེས་པ་དང་། ཕྱེ་མར་བགྱིས་པར་འགྱུར་རོ། །ཡང་ན་སྨན་གྱི་བུད་མེད་དེའི་སྐྲ་ཀུན་བཏོན་ཏེ། སྐ་རགས་སུ་བགྱིས་ནས་བཅིང་བར་བགྱིའོ། །གང་དུ་བཅིངས་པ་དེ་ཡང་རིན་པོ་ཆེ་སྣ་བདུན་དུ་འགྱུར་རོ།
en: All medicinal goddesses will pull out their hair to make it into sashes that will turn whatever is bound with them into the seven precious jewels.

source: །གང་དུ་ཞུགས་པ་ཐམས་ཅད་མི་སྣང་བར་འགྱུར་རོ།
en: The vidyā holder will enter any place invisibly.

source: །དེ་ལ་ལྷ་ཐམས་ཅད་གནས་འཆའ་བར་འགྱུར་རོ། །ཀླུ་ཐམས་ཅད་དང་། ལྷ་མ་ཡིན་ཐམས་ཅད་དང་། མི་འམ་ཅི་ཐམས་ཅད་དང་། རིག་སྔགས་འཆང་ཐམས་ཅད་དེའི་དབང་དུ་མཆི་བར་འགྱུར་རོ།
en: All deities will be his close attendants, and all nāgas, asuras, kinnaras, and vidyādharas will come under the vidyā holder’s control.

source: །འཁོར་དེ་ཐམས་ཅད་བྱང་ཆུབ་ཀྱི་སྙིང་པོ་ལ་ཐུག་གི་བར་དུ་དེའི་ཕྱི་བཞིན་རྗེས་སུ་འབྲང་བར་འགྱུར་རོ།
en: They will all, along with their retinues, attach themselves to him and follow close behind him until the time of his ultimate realization of bodhi. “

source: །དེ་ནས་རིག་སྔགས་འཆང་གནས་སུ་འཇུག་པར་འཚལ་ཞིང་སླར་ཡང་ལྡོག་པར་འཚལ་ན་སྨན་གྱི་བུད་མེད་དེ་དང་གཏམ་མི་བགྱི། རེག་པར་མི་བགྱི་བར་ལག་པའི་ཕྱག་རྒྱས་གནས་མཆོག་ཏུ་འཇུག་པར་བགྱིའོ།
en: If he wants to enter a residence and come out again, he should neither speak to the medicinal goddess nor touch her but instead form the mudrā of the noose with his hands and enter the grand residence.

source: །དེ་ནས་གནས་ཐམས་ཅད་ན་གནས་པའི་བུད་མེད་དང་། སྐྱེས་པ་དང་། ཁྱེའུ་དང་། བུ་མོ་ཐམས་ཅད་ཕྱིར་བྱུང་ནས་མདུན་ན་སྡོད་པར་འགྱུར་ཏེ། ཁ་ཅིག་གི་ལག་ན་ནི་བུམ་པ་གང་བའོ། །ཁ་ཅིག་གི་ལག་ན་ནི་གདུགས་སོ། །ཁ་ཅིག་གི་ལག་ན་ནི་ལྷའི་གོས་ཐོགས་སོ། །ཁ་ཅིག་ནི་ལྷའི་ནོར་བུ་རིན་པོ་ཆེ་ཐོགས་པའོ། །ཁ་ཅིག་ནི་དྲི་དག་གོ། །ཁ་ཅིག་ནི་མེ་ཏོག་དག་གོ། །ཁ་ཅིག་ནི་ཕྲེང་བ་དག་གོ།
en: Afterward, all the inhabitants of this residence—women, men, boys, and girls—will come outside and stand before the vidyā holder.

source: །ཁ་ཅིག་ནི་རྒྱན་དང་ལྷབ་ལྷུབ་སྣ་ཚོགས་ཐོགས་སོ། །ཁ་ཅིག་ནི་བྱུག་པ་དག་གོ། །ཁ་ཅིག་ནི་དྲིའི་ཕྱེ་མ་དག་གོ། །ཁ་ཅིག་ནི་སྤོས་ཆུས་རིན་པོ་ཆེ་སྣ་བདུན་གྱི་སྣོད་བཀང་བ་དག་གོ། །ཁ་ཅིག་ནི་ལྷའི་འབྲས་བུ་སྣ་ཚོགས་པ་དག་གོ། །ཁ་ཅིག་ནི་ལྷའི་མེ་ཏོག་སྣ་ཚོགས་ཐོགས་ཏེ། པདྨ་དང་། ཀུ་མུ་ད་དང་། པདྨ་དཀར་པོ་དང་། མན་དཱ་ར་བ་ཆེན་པོ་དང་། མཉྫུ་ཥ་ཀ་དང་། མཉྫུ་ཥ་ཀ་ཆེན་པོ་དང་། མདོག་མཛེས་དང་། མདོག་མཛེས་ཆེན་པོ་དང་། ཨ་ཏི་མུག་ཏ་ཀཱ་དང་། ཙམ་པ་ཀ་དང་། བར་ཤི་ཀ་དང་། མཐོན་ཀ་དང་། མཐོན་ཀ་ཆེན་པོ་དང་། ཀཱ་དམ་པ་དང་། སྣ་མ་དང་།
en: Some will hold full jars in their hands; some, parasols; some, divine clothes; some, great celestial jewels; some, perfume; some, flowers; some, garlands; some, ornaments and adornments of various kinds; some, unguents; some, scented powders; some, perfumed water; some, platters filled with the seven types of jewels; some, various divine fruits; and some will hold various divine flowers such as white, pink, and blue lotuses and water lilies, mandārava, great mandārava, mañjūṣaka, great mañjūṣaka, rocaka, great rocaka, atimuktaka, champak, jasmine, nīla, great nīla, laran, sumanas, yūthikā, nāgapuṣpa, kontagandha, and vārṣika.

source: ཡུ་ཏི་ཀ་དང་། ཀླུའི་མེ་ཏོག་དང་། ཀོན་ཏ་དང་། གྷན་དྷ་བར་ཤི་ཀའི་མེ་ཏོག་དག་ཐོགས་སོ། །ཁ་ཅིག་ནི་ལྷའི་ཙན་དན་གོ་ཤིརྵ་དང་། སྦྲུལ་གྱི་སྙིང་པོའི་བདུག་པ་དང་། ཨ་ག་རུ་དང་། དུ་རུ་སྐ་དང་།
en: Some will hold divine incense such as the incense of gośīrṣa, uragasāra, candana, agarwood, olibanum, or tamāla leaves. “

source: ཏམ་ལའི་ལོ་མའི་བདུག་པ་ཐོགས་པའོ། །ཁ་ཅིག་གི་ལག་པ་ན་ནི་རྨ་བྱའི་བསིལ་ཡབ་ཐོགས་སོ། །ཁ་ཅིག་གི་ལག་པ་ན་ནི་རལ་གྲིའོ། །ཁ་ཅིག་གི་ལག་པ་ན་ནི་མདུང་ཐུང་ངོ་། །ཁ་ཅིག་གི་ལག་པ་ན་ནི་རྡོ་རྗེ་དང་། དགྲ་སྟ་དང་། མདའ་བོ་ཆེ་དང་། མདུང་དང་།
en: Some of the inhabitants will hold peacock feathers in their hands; some, a sword; some, a spear; some, a diamond axe; some, a javelin; some, a spear; some, a club; some, a trident; and some will hold a musuṇḍi.

source: གཏུན་ཤིང་དང་། མདུང་རྩེ་གསུམ་པ་དང་། གཟོང་ཁ་གཉིས་པ་དག་གོ། །ཁ་ཅིག་ནི་གོ་ཆ་དང་། ཡ་ལད་བགོས་ནས་བསྲུང་བའི་ཕྱིར་ཀུན་ནས་འདུ་ཞིང་མཆི་བར་འགྱུར་རོ།
en: Some will arrive and stand nearby to provide protection with armor, coats of mail, metal shields, and cuirasses.

source: །ཁ་ཅིག་ནི་རིན་པོ་ཆེ་སྣ་ཚོགས་པའི་སྣོད་དང་། གསེར་གྱི་སྣོད་དང་། དངུལ་གྱི་སྣོད་དག་ཐོགས་པ་རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱི་མེ་ཏོག་དང་། གསེར་གྱི་མེ་ཏོག་དང་། དངུལ་གྱི་མེ་ཏོག་གིས་བཀང་ནས་ཐོགས་ཏེ།
en: Some will hold plates with various jewels, golden plates, silver plates, and also flowers made entirely of jewels, gold, or silver.

source: དེ་དག་ཐམས་ཅད་རིག་སྔགས་འཆང་ལ་དབུལ་བར་བགྱིད་དོ།
en: They will all respectfully offer these things to the vidyā holder, who, for his part, should visualize himself as Avalokiteśvara in the form of Amoghapāśa.

source: །རིག་སྔགས་འཆང་གིས་བྱམས་པ་དང་། སྙིང་རྗེ་ཆེན་པོ་ཡིད་ལ་བགྱིད་པ་དང་། སངས་རྒྱས་ཡིད་ལ་བྱེད་པས་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་དོན་ཡོད་པའི་ཞགས་པའི་ཆ་ལུགས་འཆང་བ་ཡིད་ལ་བགྱིའོ།
en: He should feel intense compassion and loving kindness and remember the Buddha.

source: །མཆོག་ཏུ་བརྩེ་བའི་ཡིད་ལ་བགྱིད་པས་ཚིག་གཞན་མི་སྨྲ་བར་དབུགས་དབྱུང་བར་བགྱི་ཞིང་ལམ་དྲང་བོ་ནས་འཇུག་པར་བགྱི་སྟེ།
en: Wholly motivated by compassion, attentive, and silent, he should give them comfort and consolation and cause them to embark on the right path. “

source: སེང་གེའི་ཁྲི་ལ་མངོན་དུ་མཆིས་ནས། དོན་ཡོད་པའི་འཁོར་ལོའི་ཞགས་པ་ཐོག་མར་སེང་གེའི་ཁྲིའི་སྟེང་དུ་གཞག་པར་བགྱིའོ།། །།འཕགས་པ་དོན་ཡོད་པའི་ཞགས་པའི་ཆོ་ག་ཞིབ་མོའི་རྒྱལ་བོ། བམ་པོ་བཞི་པ། དེའི་འོག་ཏུ་རིག་སྔགས་འཆང་རང་ཉིད་མཆིས་ནས།
en: Then, standing in front of a lion seat, the vidyā holder should place the amogha wheel-noose on it and sit down.

source: སྟེང་དུ་གཏོགས་པའི་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ལ་ཕྱག་བགྱི་ཞིང་། འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་མཆོག་སྦྱིན་པ་ལ་ཡང་ཕྱག་བགྱིའོ། །དེས་དགྲ་ཐམས་ཅད་ཕམ་པར་བགྱིས་པར་འགྱུར་རོ།
en: He should bow to all the tathāgatas above and to Noble Avalokiteśvara, the boon granter, and so bring defeat upon all his enemies.

source: །གལ་ཏེ་འོག་ཏུ་ཕྱོགས་ནས་ཕྱག་བགྱིས་ན་དེ་ནས་འཁོར་ལོས་རིག་སྔགས་འཆང་གི་ཕྱིར་རྒོལ་བ་རྣམས་མགོ་གཅད་པར་འགྱུར་རོ།
en: If he bows to those who walk upside down, the heads of his opponents will be chopped off with the wheel. “

source: །རིག་སྔགས་འཆང་མཆིས་མ་ཐག་ཏུ་གནས་རྣམ་པ་དྲུག་ཏུ་གཡོས་ནས་སྒྲ་ཆེན་པོ་འབྱུང་བར་འགྱུར་རོ།
en: As soon as the vidyā holder sits down, the residence will shake in six different ways, and a loud sound will be heard.

source: །ཅ་ཅོའི་སྒྲ་ཆེན་པོ་འབྱུང་བར་འགྱུར་རོ། །ལྷའི་རོལ་མོའི་ཆ་བྱད་ཡན་ལག་ལྔ་དང་ལྡན་པ་དག་འབུད་པར་འགྱུར་རོ།
en: There will be cries of joy and the divine sounds of the five types of instruments.

source: །ནམ་མཁའི་ལྷ་རྣམས་ཀྱིས་ཀྱང་གཞལ་མེད་ཁང་ཆེན་པོ་ནས་དབུ་རྒྱན་དང་། ཅོད་པན་གྱིས་རིག་སྔགས་འཆང་གི་མགོ་བོ་ལ་དབང་བསྐུར་བར་བགྱིད་དོ།
en: Deities will emerge from space in a great aerial palace and consecrate the vidyā holder’s head, investing him with a silk turban.

source: །དབང་བསྐུར་བ་ཙམ་གྱི་མོད་ལ་རིན་པོ་ཆེ་སྣ་བདུན་གྱི་ཆར་འབབ་པར་འགྱུར་རོ། །གསེར་གྱི་ཆར་དང་གོས་ཀྱི་ཆར་འབབ་པར་འགྱུར་རོ། །གསེར་གྱི་མེ་ཏོག་དང་། དངུལ་གྱི་མེ་ཏོག་དང་། ལྷའི་མེ་ཏོག་བཀྲ་བ་སྣ་ཚོགས་ཀྱི་ཆར་དང་།
en: As soon as he is consecrated, a rain of seven types of jewels will fall, as will a rain of gold, riches, and clothes and a rain of golden, silver, and various other types of celestial flowers and celestial adornments.

source: ལྷའི་རྒྱན་གྱི་ཆར་འབབ་པར་འགྱུར་རོ། །དེ་ནས་ལྷའི་བུ་མོས་རིན་པོ་ཆེ་སྣ་བདུན་གྱི་སྣོད་དུ་བདུད་རྩིའི་བཅུད་འཚལ་ཏེ།
en: Apsarases will then arrive and offer plates with seven types of jewels and the elixir of longevity.

source: མཆིས་ནས་འབུལ་བར་བགྱིད་དོ། །རིག་སྔགས་འཆང་གིས་བླངས་ནས་དོན་ཡོད་པའི་ཞགས་པའི་སྙིང་པོ་བཟླས་པར་བགྱིའོ།
en: The vidyā holder should accept the offerings while reciting the heart mantra of Amoghapāśa and touch the elixir to his lips.

source: །དེ་ནས་རིག་སྔགས་འཆང་གིས་རེག་པར་བགྱིའོ། །རིག་སྔགས་འཆང་གིས་རེག་པ་ཙམ་གྱི་མོད་ལ་ལྷའི་ལུས་རྣམ་པར་དག་པ་ཐོབ་ནས། པགས་པའི་མདོག་གསེར་འདྲ་བར་འགྱུར་རོ།
en: As soon as the vidyā holder sips it, he will obtain a divine, completely pure body with a golden complexion.

source: །སྐྲ་ལྷག་པར་སྔོ་བ་དང་། མིག་ཨུཏྤལ་སྔོན་པོ་ལྟར་ལྷའི་མིག་ཡོངས་སུ་དག་པར་འགྱུར་རོ།
en: His hair will turn deep blue, his eyes will be like celestial lotuses, and he will obtain divine, pure vision.

source: །ཚེའི་ཚད་ལྷའི་བསྐལ་པ་འབུམ་ཕྲག་བརྒྱ་སྟོང་དུ་འགྱུར་རོ།
en: His lifespan will increase to hundreds of thousands of millions of billions of celestial eons. “

source: །གལ་ཏེ་ཕྱིར་མི་ལྡོག་པར་འཚལ་ན། དེའི་བཅུད་ཀྱིས་ལེན་མཆོག་ལས་ཅི་ཙམ་འཚལ་བ་བླངས་ཏེ། ལྷའི་ཆབ་ཙན་དན་གྱི་དྲི་དང་ལྡན་པའི་ནང་དུ་ཞུགས་ནས་ཁྲུས་བགྱིའོ།
en: If the vidyā holder wants never to return, he should take as much of that supreme elixir as he wishes, step into rainwater perfumed with sandalwood, and bathe in it.

source: །ཁྲུས་བགྱིས་པ་ཙམ་གྱི་མོད་ལ་ཕུག་གི་སྒོ་རང་འབྱེ་བར་འགྱུར་ཞིང་།
en: As soon as he has bathed, he will find himself at an entry passage.

source: ཅི་ལྟར་དབང་ཕྱུག་ཆེན་པོའི་གཟུགས་འདྲ་བར་མཐོང་ན་ནི་འཇིག་རྟེན་ཐམས་ཅད་ཀྱི་མཆོད་གནས་ཀྱི་གཙོ་བོ་གཅིག་པུར་འགྱུར་རོ།
en: He will look as beautiful as Maheśvara and be the sole, foremost object of worship in the entire world.

source: །ཅི་ལྟར་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་བཞིན་དུ་རིག་སྔགས་འཆང་འདི་ཡང་མཆོད་པ་དང་། བཀུར་སྟི་དང་བླ་མས་བླ་མར་བགྱི་བ་དེ་ལྟ་བུར་འགྱུར་རོ།
en: Worshiped with offerings and honored as master, he will be like Noble Avalokiteśvara.

source: །གང་དུ་བཅུད་ཀྱིས་ལེན་མཆོག་འདིས་རེག་ན་འཛམ་བུ་ཆུ་བོའི་གསེར་ཡོངས་སུ་དག་པར་འགྱུར་རོ། །རྩིག་པའམ། རི་འམ། ཀ་བའམ། ལྗོན་ཤིང་ངམ།
en: If in this situation he sprinkles himself with the supreme elixir, his body will be as pure as the gold from the great river Jambu.

source: སྣོད་དམ། བུམ་པའམ། རྫ་བོ་འམ། གོས་སམ། བོང་བ་ལ་རེག་ན་དེ་དག་ཐམས་ཅད་འཛམ་བུའི་ཆུ་བོའི་གསེར་ཡོངས་སུ་དག་པར་འགྱུར་བ་ནས།
en: If he sprinkles a house, mountain, pillar, tree, vessel, pitcher, pot, pill, missile, or clod of earth, it will become refined gold like that from the great river Jambu.

source: དགོས་པའི་བར་དུ་འགྱུར་རོ།
en: Things will materialize as needed. “

source: །དེ་ནས་རིག་སྔགས་འཆང་ཀླུ་མོ་འམ། ལྷ་མོ་འམ། མི་འམ་ཅི་མོ་འཚལ་ན། རིག་སྔགས་འཆང་དེ་གོས་གཙང་མ་བགོས་ནས། ལེགས་པར་ཁྲུས་བགྱིའོ།
en: If the vidyā holder wants a vidyādhara girl, a nāga girl, an apsaras, or perhaps a young kinnarī to arrive, he should be clean, wear clean clothes, and wash carefully.

source: །ཚེས་བརྒྱད་དམ། བཅུ་བཞི་འམ། བཅྭ་ལྔ་ལ་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་གི་རི་མོའི་གཟུགས་ལ་མཆོད་པ་བགྱིས་ནས། ཉིན་ཞག་གཅིག་གནས་པར་བགྱིའོ།
en: On the eighth, the fourteenth, or the fifteenth lunar day, he should make offerings to Noble Avalokiteśvara in the cotton painting and fast for one day and one night.

source: །འཁོར་ལོའི་ཞགས་པ་ཆེན་པོ་འདི་ཆོས་ཀྱི་སྟན་ལེགས་པར་བརྒྱན་པའི་སྟན་བཟང་པོའི་སྟེང་དུ་གཞག་པར་བགྱི་ཞིང་མཆོད་པ་ཆེན་པོ་བགྱི་སྟེ། དེ་ཉིད་ཀྱི་མདུན་དུ་ཚིག་གཞན་མི་སྨྲ་བར།
en: He should place the great wheel-noose upon the divine seat adorned as the Dharma seat and perform a pūjā before it while refraining from talking.

source: ལན་སྟོང་རྩ་བརྒྱད་བཟླས་ཏེ། ཡུངས་ཀར་རེ་རེ་ནས་བཟླས་བརྗོད་བགྱིས་པ་ཞགས་པའི་སྟེང་དུ་གཏོར་བར་བགྱིའོ།
en: He should recite the mantra one thousand and eight times, incant a single mustard seed with each recitation, and throw it at the noose.

source: །ལན་སྟོང་རྩ་བརྒྱད་ཚང་ནས་ཞགས་པ་དེ་ཡང་སྦྲུལ་བཞིན་དུ་ཡོངས་སུ་འཁྱིལ་ལ་འཁོར་ལོའི་གདེངས་ཀའི་ཚུལ་དུ་མཆིས་པར་འགྱུར་རོ། །དེ་ནས་རིག་སྔགས་འཆང་གིས་ཞགས་པ་བླངས་ཏེ། ཀླུ་གནས་པའི་མཚོ་འམ། མིའམ་ཅི་གནས་པའི་མཚོ་འམ། ལྷ་མོ་གནས་པའི་མཚོ་འགྲམ་དུ་མཆིས་ནས།
en: When he has reached the number one thousand and eight, the noose will coil up like a snake, and the wheel will assume the shape of the snake’s hood.

source: དོན་ཡོད་པའི་ཞགས་པའི་སྙིང་པོ་བཟླས་ཏེ།
en: At that moment, the vidyā holder should grasp the noose, stand next to a cleft leading to a palace of nāgas, kinnaras, or apsarases, and recite the heart mantra of Amoghapāśa.

source: གནས་ཀྱི་ནང་དུ་ཞགས་པ་འཕང་བར་བགྱིའོ། །འཕངས་མ་ཐག་ཏུ་སླར་ཡང་ཁོ་ནར་དྲང་བར་བགྱི་སྟེ།
en: He should cast the noose inside the palace and immediately draw it back.

source: ཅི་ལྟ་བུའི་དོན་ཡིད་ལ་བསམས་པའི་དོན་དེ་ཞགས་པས་བཅིངས་ནས། ཅི་ལྟར་བསམས་པ་དེ་བཞིན་དུ་བགྱི་བར་འགྱུར་རོ། །གཞན་ཡང་ཇི་ལྟར་ཡིད་ལ་བསམས་པའི་ནོར་རམ། དབྱིག་ག། གསེར་རམ།
en: He will catch any girl he has in mind with the noose, and she will do whatever he wishes. “

source: ནོར་བུ་འམ། མུ་ཏིག་གམ། བཻ་ཌཱུརྱའམ། ཤང་ཀ་ཤི་ལའམ། བྱི་རུའམ། ས་ལེ་སྦྲམ་མམ། དངུལ་ལམ། གོས་སམ།
en: He should cast the noose at anything else he may wish for, be it money, gold coins, gold bullion, jewels, pearls, beryl stones, conch-like stones, coral, silver, gold, clothes, ornaments, adornments, or other things such as celestial palaces.

source: ཆས་སམ།
en: He can pull anything from anywhere.

source: རྒྱན་ནམ། གཞན་ཡང་གཞལ་མེད་ཁང་ཇི་ལྟ་བུར་འབྱོར་པ་ཅན་དག་དོན་དུ་གཉེར་ན་ཞགས་པ་འཕང་བར་བགྱི་སྟེ། དེ་ཐམས་ཅད་འདྲེན་པར་བགྱིད་དོ།
en: The objects will manifest wherever he casts the noose.

source: །གང་དང་གང་དུ་འཕངས་པ་དེ་དང་དེར་ཇི་ལྟར་ཡིད་ལ་བསམས་པ་དེ་ཉིད་ཤིན་ཏུ་གསལ་བར་ཡོངས་སུ་རྫོགས་པར་འགྱུར་རོ། །དངོས་པོ་གཞན་དུ་མི་འགྱུར་རོ། །རྒྱལ་པོའི་རིགས་སམ། བྲམ་ཟེའི་རིགས་སམ། ཁྱིམ་བདག་གི་རིགས་སམ།
en: Whatever objects he wishes for will manifest in full, and nothing else will manifest. “

source: རྗེའུ་རིགས་ཀྱིས་ཅི་དང་ཅི་བསམས་པ་འགྲུབ་པར་བགྱིད་དོ། །སྐྱེས་པའམ། བུད་མེད་དམ། ཁྱེའུའམ། བུ་མོའི་མིང་ནས་བརྗོད་དེ་ཞགས་པ་འཕངས་པ་ཙམ་གྱི་མོད་ལ་ཞགས་པས་བཅིངས་ནས་འདྲེན་པར་འགྱུར་རོ།
en: Whoever the vidyā holder wishes to attract—a woman, man, boy, or girl from a royal, brahmin, or kṣatriya family—will be pulled in as soon as he utters their name and casts the noose.

source: །ཐ་ན་རི་དགས་དང་།
en: They will be bound by the noose and brought into his presence.

source: བྱ་དང་། སེང་གེ་དང་། སྟག་དང་། གླང་པོ་ཆེ་དང་། མ་ཧེ་ཡང་འདྲེན་པར་བགྱིད་དོ།
en: He may also attract deer, birds, lions, tigers, elephants, and buffalo.

source: །གང་གི་མིང་ནས་བརྗོད་དེ་གཡུལ་འགྱེད་པའི་ནང་དུ་འཕངས་ན། དེ་ཡང་ཞགས་པས་བཅིངས་ནས་མདུན་དུ་མཆིས་ཏེ།
en: If he casts the noose in the middle of a village while uttering someone’s name, that person will be bound by the noose and brought before him.

source: ཅི་ལྟར་ཡིད་ལ་བསམས་པ་དེ་བཞིན་དུ་ཐམས་ཅད་འགྲུབ་པར་བགྱིད་དོ།
en: All his wishes will be realized. “

source: །ཟླ་བ་དང་ཉི་མ་དབབ་པར་འཚལ་ན་ཡང་། ཟླ་བ་དང་ཉི་མའི་མདུན་དུ་མཆིས་ནས། དོན་ཡོད་པའི་ཞགས་པའི་སྙིང་པོ་ལན་བདུན་བཟླས་ཏེ།
en: If he wants the moon or the sun to descend to earth, he should stand facing them and recite the heart mantra of Amoghapāśa seven times.

source: ཟླ་བ་དང་ཉི་མའི་མངོན་སུམ་དུ་ཞགས་པ་འཕངས་ནས་སླར་ཡང་དྲང་བར་བགྱི་སྟེ།
en: He should then cast the noose toward the moon or the sun and draw it in again.

source: ཟླ་བ་དང་ཉི་མ་ཞགས་པས་བཅིངས་ནས་དྲང་བར་འགྱུར་རོ། །ནམ་མཁའ་ལས་བབས་ནས་རིག་སྔགས་འཆང་གི་མདུན་དུ་མཆིས་ཏེ།
en: Bound by the noose, the moon and the sun will be pulled down and descend from the sky and stand before the vidyā holder.

source: ཅི་ལྟར་ཡིད་ལ་བསམས་པ་བཞིན་དགོས་པ་ཐམས་ཅད་སྒྲུབ་པར་བགྱིད་དོ། །འོན་ཏེ་ཟླ་བ་དང་ཉི་མའི་གནས་སུ་མཆི་བར་འཚལ་ན།
en: They will perform whatever tasks he wants them to.

source: ཞགས་པའི་ཕྱག་རྒྱ་བཅིངས་པ་ལག་པས་བླངས་ཏེ། དོན་ཡོད་པའི་རྒྱལ་པོའི་སྙིང་པོ་བཟླས་པ་དང་། རིག་སྔགས་འཆང་ནམ་མཁའ་ལ་འཕུར་ན། ཉི་མ་དང་ཟླ་བའི་སྟན་ལ་ཅི་སྲིད་དུ་འཚལ་བར་ལོངས་སྤྱོད་པར་འགྱུར་ཞིང་། སླར་བདེ་བ་དང་།
en: If he wants to visit their respective palaces, he should grasp the noose with the hand that forms the noose mudrā and recite the heart mantra of Amoghapāśa; he will then rise up through space, share the seat with the moon or the sun for as long as necessary, and descend back to earth in good health, uninjured, unharmed, and unaffected. “

source: མ་སྣད་པ་དང་། མ་རྨས་པ་དང་། ལེགས་པར་འབབ་པར་འགྱུར་རོ། །ནགས་ཁུང་དུ་འགྲོ་བར་འཚལ་ན། གཙང་མ་ལེགས་པར་ཁྲུས་བགྱིས་པས།
en: If he wants to enter a passage leading to a secret grove, he should be clean, wear clean clothes, and bathe well.

source: གོས་གཙང་མ་བགོ་བར་བགྱི་ཞིང་ནགས་ཁུང་གི་སྒོར་ལན་ཉི་ཤུ་རྩ་གཅིག་བཟླས་བརྗོད་བགྱི་སྟེ། ཞགས་པ་འཕང་བར་བགྱིའོ།
en: He should recite the mantra near the opening of the passageway into the grove twenty-one times and cast the noose.

source: །ལག་པས་ཞགས་པ་འཕངས་པ་ཙམ་གྱིས་ནགས་ཁུང་གི་གནས་ཀྱི་གཞལ་མེད་ཁང་གི་ཀླུ་ཐམས་ཅད་བཅིངས་ནས་ཐམས་ཅད་རིག་སྔགས་འཆང་གི་མདུན་དུ་མཆིས་པར་འགྱུར་ཞིང་རིག་སྔགས་འཆང་ལ་ཕྱག་བགྱིས་ནས།
en: As soon as the noose is released from his hand, all the nāgas that dwell in the palatial residence behind the passageway will come out and stand before the vidyā holder.

source: རིག་སྔགས་འཆང་ཁྱོད་གནས་ཆེན་པོ་མཆོག་ཏུ་ཞུགས་ཤིག་ཅེས་སྨྲ་བར་འགྱུར་རོ།
en: They will say, ‘Please enter, vidyā holder, into this supreme, great palace.’

source: །དེ་ནས་རིག་སྔགས་འཆང་གིས་དོན་ཡོད་པའི་རྒྱལ་པོའི་སྙིང་པོ་བཟླས་ཏེ།
en: At that point, the vidyā holder should recite the Amogharāja.

source: ལག་པ་ཞགས་པའི་ཕྱག་རྒྱས་ནགས་ཁུང་དུ་འཇུག་པར་བགྱིའོ།
en: Displaying the noose mudrā with his hand, he should enter the passageway in the grove.
